{"job_title": "SENIOR FE ANALYST - NUCLEAR", "company": "Tractebel", "company_rating": "No Rating", "location": "Bristol", "salary": "Permanent", "employment_type": "Permanent", "job_description": "Are you a passionate and experienced FE analyst who wants to work on exciting and challenging projects in the nuclear field? Do you thrive when given ownership of complex engineer problems, applying engineering principles and solutions to deliver globally recognised projects?\n\nAre you excited about the prospects and opportunities of joining a newly formed UK entity of a global engineering company, helping us grow and deliver our ambitious goal of becoming a key player in the UK nuclear industry?\n\nIf so, then TRACTEBEL has a series of opportunities arriving in 2024 and we would like to hear from you!\n\nAbout Tractebel\nTRACTEBEL is a global community of 5000+ imaginative experts, engineering a carbon-neutral future. Through our game-changing solutions for complex energy, urban, nuclear and water projects, we help our clients create a positive impact towards a sustainable world, where people and planet can collectively thrive.\n\nour uk mission\nYou will join the recently created TRACTEBEL entity in the UK, with very ambitious goals and exceptional projects. Created to support projects localised in the UK, the entity’s mission is to promote TRACTEBEL as a key player of the nuclear business in the UK.\nTRACTEBEL is a key player for the detailed design and reinforcement detailing of the reinforced concrete structures of the Nuclear Island at Hinkley Point C (HPC) and Sizewell C (SZC), some of the world’s largest construction projects. As well as our flagship projects, TRACTEBEL also has a pipeline of other projects in the nuclear industry to feed our expansion in 2024 and 2025.\nYou will be part of a dynamic, highly motivated and multicultural team. This position is a great opportunity for you to develop your professional and personal skills and work on globally recognised projects.\n\nThe OPPORTUNITY\nWe are looking for motivated FE analysts to work on the design of reinforced concrete structures of the Hinkley Point C (HPC) and Sizewell C (SZC) nuclear powerplants, as well as our future pipeline of projects. You will provide your FE expertise to successfully deliver our projects, in collaboration with our team of talented engineers and problem solvers.\n\nThe key responsibilities will include a selection of the following points, depending on your technical experience and the position you take within our team:\n\nConduct and review analysis of complex structures carried out in FEM packages (experience in using Ansys beneficial).\nAnalysing structures in dynamic scenarios, including for seismic and blast events.\nPost-processing data and results to deliver reinforced concrete designs.\nContributing to the improvement of our engineering processes, including our in house programmed tools which are developed in a range of programming languages.\nCoordinating and communicating on complex engineering problems between project teams.\nProviding technical leadership and direction for teams of FE analysts\nAiding with the training and upskilling our current team of analysts.\n\nYour Profile\nTo be successful in this role, the ideal candidate would meet the following requirements and criteria:\nMaster’s in Civil/Structural/Mechanical Engineering, or with equivalent experience.\nExperience in the use of Ansys or equivalent structural FEM software.\nExperience in the analysis of reinforced concrete structures, including dynamic analysis for seismic, blast etc.\nProgramming skills in one or several languages are a plus.\nProactive individual who can work collaboratively within a multicultural team.\nAgile and self-motivated, with a focus on improving personal and team performance and able to generate innovative outcomes to challenges.\nExperience working on major infrastructure projects and can demonstrate ability to deliver high quality work packages to schedule.\nYou enjoy new challenges and are keen to learn and willing to take responsibility whilst also wanting to support others within our team.\n\nThe following experience is also beneficial:\nExperience working in a highly regulated industry based in the UK, e.g. nuclear.\n\nWhat We OFFER\nOpportunity for a quick career progression in a dynamic and challenging environment.\nAutonomy and flexible work patterns.\nCompetitive salary and annual bonus scheme.\nCity centre office, with in-house canteen and gym facilities.\nComplementary trainings to develop your skills inside our team.\nProfessional membership subscriptions - subscription fees for one relevant professional institute per annum.\nSupport towards attaining chartership.\nGenerous holiday allowance of 28 days plus bank holidays.\nPossible international career evolution.\n\nLocation\nThe job is based in Bristol, United Kingdom.\n\nCONTRACT\nThe contract is for a permanent role.\n\n#TRACTREF-05|35|05|35#", "application_link": "https://uk.indeed.com/applystart?jk=b8f2cd86b27ef8ae&from=vj&pos=bottom&mvj=0&jobsearchTk=1icggf41dkhdt87c&spon=1&adid=435184762&xkcb=SoDi6_M35QozWLglST0LbzkdCdPP&sjdu=VOu6D6qRuqqXc0E8DLDwd7xRv9HjYMkUm7G1fPMgSa8nzud5jJzoEOfAW-k18gAJ8SYuyk-TbZ0Dklps6ma5hRFCcAf5IeydCOtCwAz45L1PgvITUqggZKHOhYKitXmA&vjfrom=tp-sponfirstjob&asub=mob&astse=74d935b49e216ad7&assa=4468"}