{"job_title": "Warehouse Manager\n", "company": "HRH international Exports ltd", "company_rating": "No Rating", "location": "Ormskirk L40", "salary": "From £30,000 a year", "employment_type": ["Full-time", "Permanent"], "job_description": "Company description\nHRH International Exports has been exporting British grocery & confectionery products since 1987. Initially exporting to European markets, but more recently, specializing in supplying wholesale distribution companies in the United States, Canada and the far east.\nThe company has expanded considerably in recent years, and as a result we are now looking to employ a warehouse manager to assist with the day to day running of the warehouse.\nJob Summary\nWe are seeking a highly skilled and motivated Warehouse Manager with FLT experience to oversee our warehouse operations. The ideal candidate will be responsible for ensuring the efficient management of inventory, logistics, and supply chain processes. This role requires a strong focus on continuous improvement and the ability to manage profit and loss effectively. The Warehouse Manager will lead a team, implement best practices, and ensure compliance with safety regulations while optimising warehouse performance.\nResponsibilities\nOversee daily warehouse operations, ensuring efficiency and productivity.\nManage inventory control processes to maintain optimal stock levels.\nImplement and monitor warehouse management systems (WMS) for effective tracking of goods.\nCollaborate with the supply chain teams to streamline logistics and transportation.\nDevelop and enforce policies and procedures to enhance operational efficiency.\nCoordinate with third-party logistics (3PL) providers to ensure seamless operations.\nHandle the booking in and booking out procedure\nSkills\nStrong knowledge of supply chain management principles.\nProven experience in warehouse management\nFork Lift truck Licence\nUnderstanding of third-party logistics (3PL) operations.\nExcellent organisational skills with a focus on business processes.\nStrong leadership abilities and team management skills.\nEffective communication skills, both verbal and written.\nJoin our team as a Warehouse Manager and play a crucial role in optimising our operations while leading a dedicated team towards success.\nJob Types: Full-time, Permanent\nPay: From £30,000.00 per year\nBenefits:\nCompany pension\nFree parking\nOn-site parking\nSchedule:\n8 hour shift\nMonday to Friday\nExperience:\nWarehouse Management: 1 year (preferred)\nWork Location: In person\nApplication deadline: 10/12/2024\nExpected start date: 15/12/2024", "application_link": "https://uk.indeed.com/jobs?q=warehouse+manager&l=liverpool&from=searchOnHP&vjk=0293cdb8dac1637c"}