{"job_title": "Data Privacy Analyst", "company": "Evelyn Partners", "company_rating": "3.5", "location": "Liverpool L3•Hybrid work", "salary": "Full-time", "employment_type": "Full-time", "job_description": "Company Description\n\nEvelyn Partners is the UK’s leading integrated wealth management and professional services group, with over 186 years of experience in helping generations of people and businesses to thrive. We offer an extensive range of financial and professional services to individuals, family trusts, professional intermediaries, charities and businesses.\nWe provide an award-winning service for our clients by employing the best people. Join us on our mission to place the power of good advice into more hands because we believe that everyone deserves access to good advice, regardless of where they’re at in their financial journey.\nAn exceptional track record of growth and innovation is driven by our core values of: Personal, offering advice based on a true understanding of what matters to our clients; Partnership, working with our clients in a joined-up, collaborative way; and Performance, demonstrating a breadth and depth of advice expertise to deliver first-class results.\nRead more about us and available career opportunities here:\nWealth, accountancy and business advisory services | Evelyn Partners\nCareers | Evelyn Partners\n\nJob Description\n\nWhat will you be doing?\nWe’re seeking a talented individual to join our Data Privacy team in Liverpool.\nYour role will be to provide support to Data Privacy in a variety of ways in order to help the wider group comply with their obligations under data privacy laws.\nAs a central point of contact for Data Privacy you will ensure all enquiries are resolved within deadlines and completion is tracked.\nYou will use and manage OneTrust to complete tasks, dispatch assessments and track completion of these within deadlines.\nAs Data Privacy Analyst, your responsibilities will include among others:\nProduce reports on the information held within OneTrust\nEnsure assessments are issued on time and support the completion of assessments by business functions\nAssist colleagues to accurately record data breaches and investigation of incidents\nTrack and manage completion of assessments and co-ordinate the completion of risks and actions arising from assessments\nManage and support with ongoing maintenance of the mailbox and provide support on information rights requests, DPIAs and due diligence reviews\nMaintain the register of Data Protection Supervisory Authority registrations\n\nQualifications\n\nTo be successful in this role, you should:\nTechnology savvy and keen to learn new systems\nGood analytical and investigative skills\nProactive, inquisitive and able to work on own initiative\nExcellent attention to detail and organisational skills\nA good communicator who can work with people and has confidence when liaising with more senior staff\nDesired:\nHas a good knowledge of Data Protection and the GDPR\n\nAdditional Information\n\nAs a colleague here at Evelyn Partners, you will have access to benefits that include:\nCompetitive salary\nPrivate medical insurance\nLife assurance\nPension contribution\nHybrid working model (role dependant)\nGenerous holiday package\nOption to purchase additional holiday\nShared parental leave\nWe are proud to value the differences that a diverse workforce brings, representative of society and our clients. At Evelyn Partners we have a wide range of highly active employee resource groups and we’re delivering multiple diversity, equity and inclusion initiatives across the organisation. It is our commitment to provide a workspace where all colleagues, regardless of identity, background, or circumstance, feel respected as individuals and feel that they can achieve their full potential and work in a safe, supportive, and inclusive environment.\nWe are happy to make any reasonable adjustments to accommodate for your needs throughout the application process. Please let your Recruiter know.", "application_link": "https://uk.indeed.com/jobs?q=data+analyst&l=liverpool&from=searchOnHP&vjk=e31a97f0571819ae"}