{"job_title": "Senior Business Analyst", "company": "No Company Name", "company_rating": "3.8", "location": "London WC2N 5DU•Hybrid work", "salary": "No Salary", "employment_type": "No Employment Type", "job_description": "Job Family Group:\nIT&S Group\n\nJob Description:\nAbout us\nAt bp, we’re reimagining energy for people and our planet. With operations working across almost every part of the energy system, we’re owning the way in reducing carbon emissions and developing more sustainable methods for solving the energy challenge. We’re a team with multi-layered strengths of engineers, scientists, traders and business professionals determined to find answers to problems.\nAnd we know we can’t do it alone. We’re looking for people who share our passion for reinvention, to bring fresh opinions, ambition, and to challenge our thinking in our goal to achieve net zero.\nWe believe our portfolio of businesses and investments in growth and transformation will result in a company with the scale, brand, capabilities, talent, and values to succeed as the digital revolution transforms our society, our industry and our planet.\nRole Synopsis\nAre you passionate about solving complex business problems at scale?\nDo you dream of well-designed and intuitive products and customer experiences?\nDo you want to work alongside traders in a dynamic environment where time matters, and everyone is always looking for the next edge?\nIf you answered yes to all these questions, then enterprise technology engineering bp and this role with a specialty in business analysis may be a good fit for you.\nThe Enterprise Technology Engineer with a speciality in Business Analysis is responsible for the definition and development of a digital product, ensuring customer need, argument, strategic alignment, feature reuse and innovation are led throughout the Product Lifecycle. This includes but is not limited to understanding and communicating customer requirements, capturing and prioritizing product features at the strategic level;; shaping the product strategy and vision; functionally designing solutions and ensuring successful roll-out and adoption\nRefining, Products and Trading is bp’s oil trading division. This highly dynamic and profitable business employs 100s of traders across the globe. This role is to help build out RPT’s arbitrage and blending product to enable those traders to make better decisions, secure more business and make more money for the company.\nKey accountabilities and experience by skill categories\nHuman centered:\nAbility to immerse yourself in knowing your customer(s) needs to reimagine and innovate product solutions.\nDemonstrable track record of discovering customer needs and translating them into inspirational, innovative solutions and detailed product requirements.\nWork closely with business teams, leaders, science, and engineering teams in an agile development environment to launch new products, platforms, features and experiences which delight our customers.\nKnows how to bring customer problem discovery and user experience into the behaviors of the team and apply them optimally.\nExperience in collaborating with teams in using relevant agile frameworks, such as Scrum and Kanban.\nStrong customer-centric approach and can demonstrate how they have previously built customer need and value into their products.\nBusiness focused:\nPartner daily with DevOps squads to develop and run digital applications, ensuring the voice of the customer is incorporated into the product team activity, maintaining an up-to-date delivery roadmap with a clear focus on business value.\nProvide visibility of delivery to internal and external partners, raising issues as required to drive product launches.\nAs needed, supports the management of service outcomes with suppliers and partners who provide developers to augment your team.\nYou'll contribute in crafting product vision and product roadmaps with an agile delivery approach in partnership with Tech while managing cyber, operational and/or regulatory risks.\nYou will be an owner a subset of product of features; making strategic product recommendations which are grounded in data and insights.\nYou will assist in shaping the product roadmap to bring the broader team’s vision to life by collaborating with a cross-functional team of engineers, designers, business partners, data professionals and other collaborators.\nYou will lead the day-to-day product development schedule from design through to release for your specific portfolio of features, own the product life cycle, and define and monitor metrics that measure the success of the product.\nStrong understanding of SDLC practices, agile practices preferred.\nExperience in data modeling and data analytics. Able to extract and analyze data using SQL and spreadsheets.\nStrong business-focused problem-solving skills.\nTechnology driven:\nYou'll partner with your technology peers and to influence end-state architecture and drive secure, resilient, performant, and scalable technology solutions that solve material business problems\nCoordinate across collaborating software development teams to drive technology integration requirements and processes\nFamiliarity with Design Thinking\nExperience of Software Development and Software Operations along with the concept of DevOps\nExperience of prioritizing backlogs, providing guidance and empowering the team to perform most optimally\nMust have a solid grasp of software-as-a-service, web services, service design & application design\nYou will be responsible for defining projects, collecting requirements, writing detailed functional specifications, including user experiences in collaboration with design colleagues, and implementing data driven cost/benefit analysis\nTransformational Leadership\nEffectively handle the planning, execution, delivery, and release of sophisticated cross-team engineering initiatives, establishing teams that continually perform at a high level\nGuides teams to reflect and identify improvements and move them towards dedication, working with teams remove obstacles and resolve issues\nActs as coach or mentor to guide teams and individuals to adopting an agile mentality and is seen as a leader in agile behaviors and practices\nYou'll influence a broad set of collaborators across the enterprise to successfully deliver on your product vision\nYou'll establish a long-term product strategy, informed by customer and business needs, to gain alignment, secure resources and overcome impediments to bring products to market\nYou will influence and create culture with Engineers and UX designers to solve core customer needs. You’ll therefore need to demonstrate the ability to successfully influence collaborators without formal authority, leading cross functional teams across geographies and business units\nBe able to demonstrate technical fluency; comfort understanding and discussing technology concepts, schedule tradeoffs and new opportunities with technical team members\nAbility to communicate, collaborate and influence effectively\nKey characteristics of senior enterprise technology engineering leaders\nIntellectually curious: comfortable navigating between the big ideas and executional realities to create an achievable strategic product vision. Comfortable with ambiguity, a hunger to learn and a seeker of new challenges.\nCommunicator & Influencer: comfortable influencing a group of executives as well as communicating your product vision clearly to your associates and partners. You can be open to different communication styles and listen carefully to diverse sets of ideas.\nDo-er: you're biased toward action and are willing to make commitments and trade-offs with other leaders to remove impediments for your team; you are a leader obsessed with delivering value in an iterative way focusing on minimum viable products that, ultimately, lead to minimum lovable experiences.\nPassionate & customer focus: you care about growing others and bringing them together around what's possible. You have a desire and ability to connect with our external or internal customers to fully understand their needs and build long-lasting relationships.\nLearner: you have an appetite to learn new things or new technologies all while exhibiting humbleness when exploring unknown technologies; you will seek for internal solutions\nTeammate: you enjoy working with diverse people and driving the team toward a common goal. You are also able to coach others and be a mentor in enterprise technology engineering. You are an expert in guiding pods/ sprint team towards outcomes for the business.\nEssential Education:\nBusiness, Economics, STEM degree, MBA or equivalent experience\nDesirable Knowledge/Experience :\nCommodity trading in particular physical oil trading\nDevelopment of bespoke solutions, rather than configuration of COTS packages\nWhy join our team?\nAt bp, we provide an excellent working environment and employee benefits such as an open and inclusive culture, a great work-life balance, tremendous learning and development opportunities to craft your career path, life and health insurance, medical care package and many others.\nWe support our people to learn and grow in a diverse and challenging environment. We believe that our team is strengthened by diversity. We are committed to crafting an inclusive environment in which everyone is respected and treated fairly.\nThere are many aspects of our employees’ lives that are meaningful, so we offer benefits to enable your work to fit with your life. These benefits can include flexible working options, collaboration spaces in a modern office environment, and many others benefits.\nReinvent your career as you help our business meet the challenges of the future.\nApply now!\n\nTravel Requirement:\nSome travel may be required with this role, this is negotiable\n\nRelocation Assistance:\nThis role is not eligible for relocation\n\nRemote Type:\nThis position is a hybrid of office/remote working\n\nSkills:\nCommercial Acumen, Communication, Data Analysis, Data cleansing and transformation, Data domain knowledge, Data Integration, Data Management, Data Manipulation, Data Sourcing, Data strategy and governance, Data Structures and Algorithms (Inactive), Data visualization and interpretation, Digital Security, Extract, transform and load, Group Problem Solving\n\n\nLegal Disclaimer:\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, socioeconomic status, neurodiversity/neurocognitive functioning, veteran status or disability status. Individuals with an accessibility need may request an adjustment/accommodation related to bp’s recruiting process (e.g., accessing the job application, completing required assessments, participating in telephone screenings or interviews, etc.). If you would like to request an adjustment/accommodation related to the recruitment process, please contact us.\n\nIf you are selected for a position and depending upon your role, your employment may be contingent upon adherence to local policy. This may include pre-placement drug screening, medical review of physical fitness for the role, and background checks.", "application_link": "https://uk.indeed.com/applystart?jk=797e92b40ed370fb&from=vj&pos=bottom&mvj=0&jobsearchTk=1ic161lgcj6u487k&spon=1&adid=413093717&xkcb=SoAs6_M35BEJaPAlST0LbzkdCdPP&sjdu=i6xVERweJM_pVUvgf-MzufP_wZDyVPczTVsvYigk1x1uRmjej8-ziFQK3TIY-5xa&vjfrom=tp-sponfirstjob&asub=mob&astse=4ee4f51250b44bfa&assa=1315"}