{"job_title": "Data Analyst", "company": "Your Housing Group", "company_rating": "2.8", "location": "Warrington WA3 7QH•Remote", "salary": "£30,000 - £35,000 a year", "employment_type": "Full-time", "job_description": "Job Introduction\nJob Title: Data Analyst\nSalary: £30,000 - £35,000\nContract: Permanent\nLocation: Homebased North West\nWeekly Hours: 35\nSo…. What is this role exactly?\nThis is an exciting opportunity for a Data Analyst in the Data and Business Intelligence Team.\nAs a Data Analyst within our Data and Business Intelligence Team, you will play a key role in supporting our mission to provide safe, affordable housing and exceptional customer service to our residents. You will be working alongside other data professionals to deliver and embed our Data Governance Framework and advanced Data Management capabilities to ensure data integrity and accuracy. In addition, you will be responsible for extracting, analysing, and interpreting complex data to provide valuable insights that drive evidence-based decision making across the organisation.\nWe are looking for an individual with a passion for data, ready to help establish YHG as a leading example in the social housing sector as a data driven organisation.\nWhat will my working week look like?\nYou will be homebased, living within the North West, within a reasonable travelling distance of our Head Office in Warrington, to attend meetings and training courses when needed. Realistically, you will be required to visit our Head Office approximately 2-4 times a month.\nWhat will I be responsible for doing?\nFirst and foremost, you will work with the Data and Business Intelligence team and YHG Data Community to develop and implement best practices for data governance and management across all YHG business areas.\nLead/Support data governance initiatives and issue remediation, including data quality, data management, and data lifecycle processes.\nOne of the great things about this role is the opportunity to work closely with different areas of the organisation and understanding and exposure to multiple systems as well as some of the best data governance and data quality tools available.\nOther responsibilities will include:\nEnsure data is accurate, consistent, and reliable by performing regular data profiling and quality checks and reporting assurance levels to leadership teams\nDevelop, maintain, and enhance regular and ad hoc reports using SQL and other data analysis tools\nAnalyse datasets to identify trends, patterns, and opportunities to support strategic decision-making\nCollaborate with internal stakeholders to define data requirements and deliver actionable insights\nAct as a liaison between the Data and Business Intelligence Team and other departments, fostering a culture of data literacy and evidence-based decision-making\nTranslate complex data findings into clear, concise reports and presentations for non-technical stakeholders\nIdentify and recommend improvements to data processes and reporting methods to enhance automation, efficiency and accuracy\nStay updated with industry trends, tools, and best practices related to data analysis and governance and communicate these to the wider team using bulletins or similar, highlighting important themes or recommendations\nAnd what would make me stand out from the crowd?\nTo be a successful as Data Analyst, here at YHG, you will have….\nUnderstanding of the importance of data as an asset, Data Governance / Data Management principles and how organisations use them to enable accurate analysis and insight services\nAnalytical mind-set with a strong bias towards evidence-based decision making, working with business SMEs, and using data and metrics to tell a story, or set a context together\nDesire for consistency, standards and process-adherence, enjoyment in the work involved in achieving these through data dictionaries, glossaries, documentation and change control\nAttention to detail, high standards of accuracy and the ability to deliver consistently to these in areas like data quality, technical documentation, and presentation of insights\nTechnically skilled in Data Analysis and process driven in its application, but with the ability to discover new value through exploration\nKnowledge of core data principles, such as data types, classification, integrity, consistency, and data structures, such as relational databases, ETL/ELT, datasets, APIs\nIdeally you will have …….\nProven experience in a role involving data analysis or data management, with the ability to articulate the components/structures/roles and their purpose and importance in the wider framework\nStrong proficiency in T-SQL for ad-hoc data discovery, selection, extraction, transformation, and analysis\nAbility to perform data profiling, data management, and instil data governance principles\nProficiency in data visualisation and presentation tools (e.g. Excel, Power BI, Tableau, PowerPoint) with the desire to develop these skills further\nExcellent analytical and problem-solving skills, inquisitive and open-minded when looking at solutions or root cause analysis\nStrong communication, stakeholder management and people skills, with the ability to convey data concepts or insights to non-technical stakeholders\nAble to communicate between the technical and the non-technical\nAble to work autonomously with minimal supervision\nThis role is really suited to someone who…\nHas experience in the social housing sector or a similar regulated environment\nCan use predictive analytics tools and/or techniques to deliver predictive/prescriptive insights\nHas Degree in STEM subject or equivalent\nHas Understanding of GDPR and other data protection regulations\nHas familiarity with other data tools and programming languages (Microsoft BI Stack, Azure Synapse/Fabric, Collibra Data Governance, Informatica Data Quality\nHas Relevant professional Certifications\nIf you feel this could be the right role for you, we would love to hear from you!\nFor more detail on the role, please review the role profile available by visiting the vacancy on our website - www.yourhousinggroup.co.uk/careers.\nThat all sounds great, what’s in it for me?\nIn return we offer £30,000-£35,000 for a 35-hour week, and 25 days annual leave (holidays also increase with time served) plus Bank Holidays, but our employee offering provides much more than just a competitive salary and holiday allowance.\nAt #TeamYHG we measure performance on outputs and quality, not hours and minutes. We offer a flexible, homeworking culture where you’re trusted to get the job done. If you need time for an appointment, the school run or an exercise class, if it fits with business needs, we’re open to what works for you too. And when you need to collaborate with your team, you can visit Youggle House – our purpose-built collaboration, wellbeing, and social space in Birchwood, Warrington.\nOn top of this, we’ll provide you with a great benefits package, including a contributory pension where we match whatever you choose to contribute (up to 8%), an advanced level Healthcare cash plan through BHSF, that doesn’t just provide dental and optician cashback but also health and wellbeing benefits (such as 24/7 GP Access, money back from prescriptions and alternative therapy treatments) and an amazing discount scheme that gives you access to half price cinema tickets, subsidised gym memberships and a huge range of discounts with some of the biggest high street and online names.\nFor more of our great benefits, please review the benefits information sheet available by visiting the vacancy on our website - www.yourhousinggroup.co.uk/careers.\nAnd who are Your Housing Group?\nYour Housing Group is a registered social landlord helping people at every stage of life to live in quality homes they can afford.\nAs one of the North’s sector-leading landlords, we are proud to play our role in tackling the UK's housing crisis by continually reinvesting in our 29,000 properties and tailoring our services to meet the diverse needs of our customers. We also build over 1,000 new homes each year.\nWe’re an employer of choice, over 88% of colleagues here recommend us as a 'great place to work\nClosing Date: 20th November 2024\nWe review applications as they’re received and reserve the right to close this advert early; if you’re interested, please apply ASAP to avoid disappointment.\nYour Housing Group values diversity and encourages applications from all communities. Your Housing Group operates a Guaranteed Interview Scheme for any applicants who declare they have a disability, if these applicants meet the minimum requirements for the role (as set out in the role profile and/or person specification) they will be guaranteed an interview. Your Housing Group welcomes applications from our customers, however, access to confidential information and probity will be explored to determine whether there is a potential conflict of interest or security issue present which may prevent the Group from being able to proceed with the application. YHG2", "application_link": "https://uk.indeed.com/jobs?q=data+analyst&l=liverpool&vjk=7dd5d56321b9a1e3"}