{"job_title": "People Analytics Senior Analyst", "company": "Phoenix Group", "company_rating": "3.9", "location": "London", "salary": "£35,000 - £45,000 a year", "employment_type": "Permanent", "job_description": "We have an incredible opportunity to join us here at Phoenix Group as an People Analytics Senior Analyst to join our people analytics team!\nJob Type: Permanent\nLocation: This role can be based from any of the Phoenix Offices, with time spent working from the office and at home as needed\nFlexible working: All of our roles are open to part-time, job-share and other types of flexibility. We will discuss what is important to you and balancing this with business requirements during the recruitment process. You can read more about Phoenix Flex here.\nClosing Date: 15th November 2024 (23:59)\nSalary and benefits: £35,000 - £45,000, plus bonus 8% target up to 16%, private medical cover, 38 days annual leave, excellent pension, 12x salary life assurance, career breaks, income protection, 3x volunteering days and much more!\nWe have an incredible opportunity to join us here at Phoenix Group as an People Analytics Senior Analyst to join our people analytics team!\n\nThe role\nAs a People Analytics Senior Analyst you will work with Head of People Analytics & Insights, alongside a small team of People Analytics Consultants to deliver strategically aligned data analysis, insights & analytics across Phoenix Group. You will be innovative, curious and willing to challenge the status quo, with a passion for delighting customers\nIn this role, you will be responsible for:\nAnalysing HR data in to ensure accuracy, completeness, and consistency.\nDeveloping and maintaining reports and dashboards in Oracle OTBI, Visier, and OrgVue to support HR and business leaders in making data-driven decisions, as well as providing general BAU support to the business including training, mentoring on these systems\nConducting ad-hoc analysis and data modelling to support HR and business initiatives.\nIdentifying and troubleshooting data discrepancies and pro-actively work with HR and functional teams to resolve issues.\nPartnering with HR and functional teams to gather requirements for new reports and dashboards, and design solutions that meet their needs\nActing as an internal consultant owning the design, build and delivery of impactful and insightful dashboards, visualisations and reports\nDeveloping and maintaining data dictionaries, process documentation, and training materials to ensure consistent and accurate data management practices.\nConsidering and managing ethical and data privacy processes and procedures (e.g. GDPR) as part of their work.\nWhat are we looking for?\nExperience across HR/People functions, ideally in People Analytics teams\nStrong analytical and problem-solving skills, with the ability to translate business requirements into design & delivery outputs from both qualitative and quantitative data\nAdvanced experience of Excel is essential\nFamiliarity with Oracle HCM Cloud, in particular OTBI, is essential,\nExperience managing cloud People Analytics systems, in particular Visier and OrgVue (preferred)\nWe want to hire the whole version of you.\nWe are committed to ensuring that everyone feels accepted and welcome applicants from all backgrounds. If your experience looks different from what we've advertised and you believe that you can bring value to the role, we'd love to hear from you.\nIf you require any adjustments to the recruitment process, please let us know so we can help you to be at your best.\nFind out more about #LifeAtPhoenix\nGuide for Candidates: thephoenixgroup.pagetiger.com/guideforcandidates\nFind or get answers from our colleagues: www.thephoenixgroup.com/careers/talk-to-us\n#LI-SM1\nLI-Hybrid", "application_link": "https://uk.indeed.com/applystart?jk=e6028aeb073318f1&from=vj&pos=bottom&mvj=0&jobsearchTk=1ibu95i9mkk1o87o&spon=1&adid=436817526&xkcb=SoB26_M36-aZluRYT50LbzkdCdPP&sjdu=vUz3PJIdpGfygLQXVlxEDn62u999uQX9H4IRIP9QZzDjxBS7q4ZVEbncsyKjuOpLfsvFrV2BItLA8_Pz8DSrlgOnlJc74fXKmpFuJd8DtU8mRERh3bBiGtdQ-4JBJWjl&vjfrom=tp-sponfirstjob&asub=mob&astse=02434d4310e62171&assa=1519"}