{"job_title": "Senior Corporate Relationships Manager", "company": "Science Museum Group", "company_rating": "4.0", "location": "London SW7 2DD•Hybrid work", "salary": "£42,700 - £47,000 a year", "employment_type": "Permanent", "job_description": "Senior Corporate Relationships Manager\nDo you have experience securing 6 and 7 figure corporate sponsorships or corporate partnerships? Do you want to help contribute to the Science Museum Group's mission to inspire futures by securing high-value corporate sponsorships?\nAbout us\nWith unparalleled collections in the fields of science, technology, engineering, mathematics, medicine and media, the Science Museum Group (SMG) aims to be a leader in informal learning where people of all generations can be inspired by the science that shapes the modern world. Committed to supporting our mission, the Fundraising & Partnerships team plays a key role in delivering the Group's ambitions.\nWe are now recruiting for a Senior Corporate Relationships Manager to join on a full-time (35 hours per week), permanent contract. This role is based at the Science Museum in London, with hybrid working also available.\nAbout the role\nAs a Senior Corporate Relationships Manager, you will make a significant contribution to the successful delivery of the Science Museum Group's vision through securing high-value corporate sponsorships to support our ambitious masterplan and exhibition programme. You will be responsible for leading new business conversations to support the Corporate Relationships Team's drive to create exciting new partnerships and raise significant income for the Science Museum Group.\nBy securing corporate sponsorship and building new relationships, you will contribute to the Group's ability to carry out its mission to inspire future generations to engage with STEM subjects. You will work closely with the Head of Corporate Relationships to identify corporate relationship opportunities, develop skills and knowledge within the team, and secure major corporate sponsorships.\nThis is an exciting opportunity to contribute to a bold, dynamic, world-renowned organisation with incredible vision, and to play a key part in an established and support team. You will have opportunities to develop new skills, experiences, and knowledge through high-level working relationships within the Museum and externally with key stakeholders.\nAbout you\nJoining us you will have experience securing 6 and 7 figure corporate sponsorships or corporate partnerships, with demonstrable experience of influencing, negotiating and utilising sales techniques. You will have good organisation skills with the ability to set priorities and manage multiple projects effectively.\nCrucially, you will have good communication and listening skills with the ability to deal with internal and external senior stakeholders confidently and work effectively with people at all levels across the museum. You will be able to collaborate with others effectively and foster a team-orientated working environment.\nApplying\nView the Vacancy Information Pack listed under 'Attachments' on the vacancy listing on our website for more details about the role and the application process, or click 'Apply Online' to submit an application.\nDon't feel you meet all of the criteria? At SMG, we are committed to building a workforce that is open for all, and welcome you to apply, even if your experience doesn't fit perfectly. With your transferable skills, you could be the right candidate for this, or other opportunities that we have.\nWhat we offer\nJoining us as an employee, you will have the opportunity to develop your career in a world-class museum group. We understand that work/life balance and wellbeing is crucial to our colleagues, so we offer the perks listed below, as well as support for things that happen in life such as parental and adoption leave, sickness, and career breaks.\nSupport with personal and professional development\n27 days annual leave in addition to bank holidays\nEmployee assistance programme\nEnhanced contributory pension\nUnmind App and other wellbeing support\nInterest-free loans\nDays Out discounts\nHealth & Dental Insurance\nOpen for All is one of the Science Museum Group's five core values and sets out our important aspiration to be a place for everyone. We are working hard to understand our organisation better and to foster a culture that recognises and values different backgrounds, mindsets, skills, experience, knowledge, and expertise. By having greater diversity, we believe that we will be a stronger and better organisation, capable to continue to Inspire Futures.", "application_link": "https://uk.indeed.com/applystart?jk=6da63110ef2e7be2&from=vj&pos=bottom&mvj=0&jobsearchTk=1icdatvs8hpl983k&spon=1&adid=428109338&xkcb=SoBs6_M35Nd33pxCJh0LbzkdCdPP&sjdu=vUz3PJIdpGfygLQXVlxEDtrp31zrUKvX5DyE7UoHSnY9kCyt7lGknqRpyqquah-SoHIRHDVm_Dqt10iAIM0-svcX-mBZ-r8CCgdY6U2hEDjYtnETcPb3GIVi2xZlHuwi&vjfrom=tp-sponfirstjob&asub=mob&astse=3924588db9de6dd0&assa=7628"}