{"job_title": "Netsuite Support and Development Analyst", "company": "ClearCourse", "company_rating": "No Rating", "location": "London•Hybrid work", "salary": "From £50,000 a year", "employment_type": "Permanent, Full-time", "job_description": "Are you a Netsuite expert looking for an exciting and challenging new role? Do you have a passion for creating efficiencies and process improvement, with a detailed eye for analytics?\nClearCourse is growing and looking for a Netsuite Support and Development Analyst to join us in a newly created position. In this role you will be key in the creating maximum efficiency and effectiveness when it comes to processes, systems and controls relating to Netsuite. Our established and high performing team are dedicated to supporting users of Netsuite and Planful BI, across our business and shared service centre. This will be an exciting role for someone looking for a challenge within a fast growing ever changing role.\nThis role will be responsible for the following, plus more:\nManaging support-related resources, NetSuite Support Configuration, development of support knowledgebase, SLA reporting, upskilling and half-yearly customer satisfaction survey\nAnalysis of complex issues to find resolution\nUndertake Netsuite customisations, integrations, workflows and scripts\nMigration of acquired businesses, using Ipaas tool, integrating Sales CRM data and building bank integrations when required\nImproving, updating and maintenance of migration blueprints\nThe ideal experience for this role will be:\n3+ years NetSuite experience, including administration and configuration using SuiteBuilder, SuiteFlow, Freemarker, and HTML\nManagement experience\nStrong customer service orientation, providing technical advice, guidance, and working to SLAs\nExperience in financially driven migrations and integrations\nDeep understanding of core Finance Processes\nExperience of testing system enhancements and test management\nExperienced developer with iPaaS tool, such as Celigo\nWhat do we have to offer you?\nLife Assurance and Group Income Protection\nPrivate medical cover with cash plan\nEnhanced Company Pension\nHybrid-working model with 25 days annual leave + your birthday off\nEmployee wellbeing perks – including Peppy Health, Perkbox, etc...\nEnhanced maternity, paternity and adoption pay\nGenerous training budgets and reimbursement for professional memberships\nIf this sounds like the role you are looking for, we look forward to receiving your application.\nJob Types: Full-time, Permanent\nPay: From £50,000.00 per year\nBenefits:\nBereavement leave\nCasual dress\nCompany events\nCompany pension\nCycle to work scheme\nEnhanced maternity leave\nEnhanced paternity leave\nHealth & wellbeing programme\nLife insurance\nPrivate dental insurance\nPrivate medical insurance\nSick pay\nWork from home\nSchedule:\nMonday to Friday\nWork Location: Hybrid remote in London", "application_link": "https://uk.indeed.com/applystart?jk=0bc55db3f711b121&from=vj&pos=bottom&mvj=0&jobsearchTk=1icgel8pjkhi487h&spon=1&adid=438326832&xkcb=SoBa6_M35QVax6zTtZ0LbzkdCdPP&sjdu=Ba-65vCbwHkLPleyOgT-MFdL_1HPczXxumhAUtw3JQ7S_OwRBVpHdYS4EFwXGdCW-4Jtw-Y6WLyDgRm8U1amADQ2b9Il319ZICwwVIqdchs&vjfrom=tp-sponfirstjob&asub=mob&astse=3a46aef14669cf29&assa=8756"}