{"job_title": "Quantity Surveyor\n", "company": "Integra Contracts Ltd", "company_rating": "No Rating", "location": "Beckenham", "salary": "No Pay", "employment_type": ["Full-time"], "job_description": "Job Summary\nOur company specialises in suspended ceilings and drylining partitioning systems. We are seeking a skilled Quantity Surveyor to join our dynamic team. The ideal candidate will play a crucial role in managing project costs, ensuring that financial aspects are effectively controlled throughout the project lifecycle. This position requires a detail-oriented individual with strong analytical skills and a solid understanding of construction processes.\nResponsibilities\nPrepare and manage cost estimates for projects, ensuring accuracy and completeness.\nConduct feasibility studies to assess the viability of projects from a financial perspective.\nMonitor project expenditures and implement cost control measures to maintain budgetary constraints.\nCollaborate with architects, engineers, and contractors to ensure alignment on project specifications and financial implications.\nPrepare tender documents, contracts, and agreements for procurement processes.\nConduct regular site visits to assess progress and identify any potential cost-related issues.\nProvide advice on contractual claims and disputes as they arise during the project lifecycle.\nMaintain comprehensive records of all financial transactions related to projects.\nExperience\nProven experience in quantity surveying within the construction industry is highly desirable.\nStrong knowledge of cost control methodologies and practices.\nExcellent analytical skills with attention to detail.\nProficient in relevant software applications for quantity surveying and project management.\nStrong communication skills, both written and verbal, with the ability to work collaboratively within a team environment.\nThis role offers an exciting opportunity for professional growth within a supportive environment, where your contributions will be valued as we work towards delivering successful projects together.\nJob Type: Full-time\nBenefits:\nCompany pension\nFree parking\nOn-site parking\nSchedule:\nMonday to Friday\nEducation:\nDiploma of Higher Education (preferred)\nExperience:\nsurveying: 4 years (preferred)\nLicence/Certification:\nDriving Licence (preferred)\nWork Location: In person\nReference ID: INTEGRA QS", "application_link": "https://uk.indeed.com/jobs?q=quantity+surveyor&l=london&from=searchOnHP&vjk=c1d63bdfb14d0e36"}