{"job_title": "Product Operations Analyst", "company": "PEI Group", "company_rating": "3.7", "location": "London EC2V", "salary": "No Salary", "employment_type": "Permanent, Full-time", "job_description": "About The Role\nWe are seeking a highly analytical and detail-oriented Product Operations Analyst to join our team in London. The ideal candidate will have hands-on experience with Heap.io or similar product usage tracking tools and be proficient in working with reporting platforms such as Databricks Dashboards, Power BI or Tableau. The role will focus on optimizing product performance, informing the product strategy, ensuring data-driven decisions, and supporting cross-functional teams with accurate and actionable insights.\nKey Responsibilities:\nData Management and Analysis:\nLeverage Heap.io to track, analyze, and report on product usage data and user behaviour.\nCombine product usage data, financial data and engineering team data to build, maintain and automate comprehensive reports and dashboards using platforms such as Databricks Dashboards, Power BI, or similar tools.\nDevelop insights from large disparate database to inform product decisions and operational improvements.\nAdvocate for best practices in tools and instrumentation to ensure accurate, consistent and useable data.\nCross-Functional Support:\nCollaborate with Product, Engineering, and Data Science teams to identify and prioritize operational improvements.\nTranslate complex data insights into actionable recommendations for stakeholders.\nServe as the primary contact for product data-related inquiries and issues.\nProcess Optimization:\nIdentify opportunities to improve product workflows, user experience, and operational efficiency.\nStandardize product reporting processes to ensure consistency, accuracy, and transparency across the organization.\nMonitor key performance indicators (KPIs) and propose initiatives to improve product and operational performance.\nStakeholder Communication:\nProvide regular updates and insights to senior management and key stakeholders on product performance.\nPresent findings through compelling data visualizations and clear communication.\nEnsure all stakeholders have access to timely, accurate, and relevant data to support decision-making.\nAbout You\nRequired Skills & Experience:\nProven experience with Heap.io for product analytics and data tracking.\nHands-on experience with reporting platforms like Databricks Dashboards, Power BI or Tableau.\nStrong analytical skills with the ability to manipulate and interpret large datasets.\nProficiency in SQL and/or Python for data querying and analysis is a plus.\nExcellent communication skills with the ability to translate data insights into actionable recommendations.\nStrong problem-solving skills and attention to detail.\nAbility to work in a fast-paced, dynamic environment, handling multiple tasks and stakeholders.\nPreferred Qualifications:\nBachelor’s degree in a technical discipline.\nPrevious experience in a Product Operations role, or a related data/analytics role.\nFamiliarity with additional analytics platforms such as Fullstory, Pendo, Amplitude etc\nWhy You’ll Love Working with Us:\nInnovative Environment: Be part of a team that values creativity and innovation.\nProfessional Growth: Opportunities for continuous learning and professional development.\nCollaborative Culture: Work in a supportive and collaborative environment with a diverse group of professionals.\nImpactful Work: Your work will directly impact investment professionals worldwide, enhancing their user experience.\nGenerous Leave: 25 days annual leave (+8 bank holidays), Holiday-Flex and a gifted December break.\nVolunteer Time: 4 days of volunteer leave per year to give back to your community.\nComprehensive Benefits: Life Cover, Private Medical Insurance.\nFinancial Perks: Employee Incentive Reward Scheme, 4.5% matches pension contribution and a Cycle to Work Scheme.\nEmployee Support: Employee Assistance Programme to enhance employee’s wellbeing & Referral Scheme to help reward your network.\nFlexible Working: Enjoy a flexible working policy to balance your professional & person life.\nPEI2\nAbout Us\nWho we are:\nPEI Group is a subscriber-focused business intelligence company. With our multi-talented global team of over 480 people, spread across EMEA, USA & Asia, our purpose is to inform and connect investment professionals across global, specialised markets. We identify specific high growth, high value investment sectors and themes where deep insight, strong market relationships and active capital flows are critical for success.\nWhat we do:\nPEI Group provides industry-leading journalism, data, and market insight to subscribing clients via a wide portfolio of specialist brands supported by our robust and scalable digital publishing, analytics, and database platform. We also track the firms and individuals who shape markets and bring client-communities together to enable knowledge sharing, profile building and relationship development through professional networks and events. Wherever our markets are active – in New York, Los Angeles, Tokyo, Sydney, Hong Kong, Singapore, London and elsewhere – PEI is hard at work examining crucial market forces and shifting investment themes, identifying active investors and their capital allocations, and scanning ahead for regulatory changes, new compliance requirements and other risk factors.\nAt PEI we value diverse talent and welcome applications from everyone – regardless of background. We are an equal opportunity employer and our inclusive culture at PEI is reflected in every stage of the recruitment journey. Please inform us at initial stages of the recruitment process if you require any reasonable adjustments and we can accommodate this.\nPEI Group supports flexible working arrangements, and we welcome career returners.", "application_link": "https://uk.indeed.com/applystart?jk=ef357fc9341cf26c&from=vj&pos=bottom&mvj=0&jobsearchTk=1ibtq8lrim3pr89p&spon=1&adid=422488252&xkcb=SoBM6_M3698tZFSKcx0LbzkdCdPP&sjdu=aIGyDlciLmUj1iQXaThzVQ_sTPo83KSVr4OIJqI52jXPOKSMSAkL8eoy8ciYxsMbEzdEoOJrzpW78u3Ges4PJg5cRwaeXTOyIIWGQr1c7HlUY6m_2Ix1ckfQoqtkmg82&vjfrom=tp-sponfirstjob&asub=mob&astse=9def272313ca9e21&assa=4771"}