{"job_title": "UK Based Data Engineer", "company": "Beyond Putting Data to Work Ltd", "company_rating": "No Rating", "location": "London WC2E 9LY•Hybrid work", "salary": "£50,000 - £65,000 a year", "employment_type": "Full-time", "job_description": "Beyond:Putting Data to Work delivers data-led strategic consulting services globally, bringing cutting-edge data science, engineering, analytics and visualisation expertise by having the highest quality talent, borderless data services and best-in-class creative thinking.\nWe pride ourselves on our ability to swiftly get under the skin of our clients’ challenges and bring fresh perspectives and solutions to allow them to succeed, whatever their market, wherever their location\nWe deliberately recruit professionals with diverse experience which makes for a culture of healthy challenge, respect and collaboration.\nWe are seeking a Data Engineer to join our London based team and while this is a hybrid role (NOT REMOTE) where you may combine working from home with time in the office, you must be prepared to travel to the office on a weekly basis. As part of the Data Engineering team, you will be working alongside the Technology, Analytics and Commercial Teams. You will design and create cutting edge data solutions to our clients across various domains.\nJob purpose\nAs part of the Data Operations team, you will be working alongside the Technology, Analytics and Commercial Teams, and will assist with the transfer of information to support project delivery for our clients.\nKey Responsibilities\n· Building new and performant automated, re-usable, scalable and secure data processes for internal BA purposes and client-oriented projects\n· Maintaining existing data processing pipelines, troubleshooting issues and implementing fixes\n· Documenting new and existing data processing pipelines and operations\n· Monitoring data processing efficiency and proposing solutions for improvements\n· Guiding and assisting with set up of development environment on Linux systems\n· Participating in the team activities, like:\n- Code reviews\n- Incident resolution\n- Training\nThe key performance indicators that will be used to measure the effectiveness of delivery against each key responsibility:\n· Repeatable data processes and automation\n· Documented process manuals, data audits and IP\n· Client satisfaction\n· Efficiency improvements\n· On-time delivery\n· Processes monitored\nSkills and Experience:\n· Strong organisation skills; with the ability to split assigned tasks into smaller work packages and deliverables\n· 2+ years of work experience using Apache Airflow\n· 3+ years of work experience using Python\n· 5+ years of work experience using Linux systems and their administration\n· 5+ years of work experience using various databases (PostgreSQL, MSSQL, Etc)\n· Ability to maintain high attention to detail\n· Ability to estimate and deliver on-time\n· Higher education degree\n· Strong Knowledge of Modern Data Architectures: In-depth understanding of contemporary data architectures, including Data Warehouses, Data Lakes, and Lakehouses, and their various applications and use cases.\n· Experience with Cloud Infrastructure: Demonstrated experience working with cloud platforms (AWS, Azure, or GCP) to build, manage, and optimise data solutions.\n· Development Lifecycle Management: Practical experience in the full development lifecycle, from development through UAT to production.\nPersonal Attributes:\nFirst-class communicator skills, with the confidence to challenge decisions when appropriate\n· Team player – working closely with colleagues to deliver for clients and to develop yourself and mentor those around you\n· Self-starter, who is not afraid to ask questions to learn and get results\n· Have the ability to work in a fast-paced dynamic work environment\n· Open-minded – happy to go through code reviews and code-roasting sessions\n· Curious – simple reasoning for the given problem is not an option, desires to know more details\nJob Type: Full-time\nPay: £50,000.00-£65,000.00 per year\nAdditional pay:\nBonus scheme\nBenefits:\nAdditional leave\nCompany pension\nHealth & wellbeing programme\nLife insurance\nPrivate medical insurance\nReferral programme\nWork from home\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nLondon, WC2E 9LY: reliably commute or plan to relocate before starting work (required)\nApplication question(s):\nAre you able to work from our London office every Wednesday?\nDo you have a valid visa / or entitlement to work in the UK for no less than 3 years?\nExperience:\nAWS: 1 year (preferred)\nDevelopment lifecycle: 3 years (required)\nCloud infrastructure: 3 years (required)\nWork authorisation:\nUnited Kingdom (required)\nLocation:\nLondon, WC2E 9LY (preferred)\nWork Location: Hybrid remote in London, WC2E 9LY\nApplication deadline: 20/11/2024\nReference ID: Data Engineer London\nExpected start date: 18/11/2024", "application_link": "https://uk.indeed.com/jobs?q=data%20engineer&l=london&from=searchOnHP"}