{"job_title": "Junior Data Engineer", "company": "No Company Name", "company_rating": "1.5", "location": "London", "salary": "£25,000 - £40,000 a year", "employment_type": "Full-time", "job_description": "Job Title: Data Scientist\nInformation Tech Consultants Ltd (ITC) is a London-based mobile app development consultancy, specializing in Android, iOS and Data Scientist solutions. With over 35,000 hours accumulated and clients across the UK and Europe, it’s safe to say we know apps well! Each of our practice areas leverages specialized expertise, methodologies, and software to ensure that we deliver the most beneficial solutions to our clients.\nWhat are we looking for?\nHere at Information Tech Consultants Ltd (ITC) we are providing a unique opportunity for entry level Data Scientists to utilize our skills and expertise to become successful experienced Data Scientist, working with several highly recognized UK and International companies including multiple Fortune 500 and FTSE 100 Clients.\nThe focus will be on Data Scientist role and complete training will be provided for the same. You will provide professional consulting services working onsite for start-ups, medium and large sized companies. You will be working on large complex projects so you should be comfortable dealing with demanding stakeholders and providing time driven results. Innovation, Collaboration and Passion are the three core values that we look for in all our personnel.\nWho are we looking for:\nApplicants must be experienced working with the following:\nEssential:\n· Machine Learning\n· SQL Server\n· Data analysis/Mining/ Science/Wearhouse\n· statistical analysis\n· Linear Regression\n· Database\nDesirable: Experience with any of the following:\n· SQL\n· Python\n· Hadoop\n· R\n· Java/C++\nQualifications and Attitude:\n· Master's degree and above with research.\n· You should be entitled to work in the UK and must be willing to travel within the UK as per project/client demands.\nWhat do we offer:\nWhile we offer an unrivalled salary, you will also have the opportunity to earn a 5-15% increase each year on top (national average is 2.5%, source- the guardian). In addition, you will also gain access to our excellent management support network. You will obtain the capabilities to think creatively, design solutions and gain vital work experience.\nJob Type: Full-time\nPay: £25,000.00-£40,000.00 per year\nApplication question(s):\nWhat is your Visa status? Kindly mention if on any type of Dependent Visa\nWill you be open for training in London and relocation to any part of UK on Projects?\nAre you available to join immediately?\nEducation:\nBachelor's (required)\nWork authorisation:\nUnited Kingdom (required)\nWork Location: On the road", "application_link": "https://uk.indeed.com/jobs?q=junior+data+engineer&l=london&from=searchOnHP&vjk=d5fbcdf956d0c44f"}