{"job_title": "R & Python Data Science Tutor", "company": "Outlier Ai", "company_rating": "No Rating", "location": "London", "salary": "£30 an hour", "employment_type": "Freelance", "job_description": "Outlier helps the world’s most innovative companies improve their AI models by providing human feedback. Are you an experienced software engineer who would like to lend your coding expertise to train AI models?\nWe partner with organizations to train AI large language models, helping cutting-edge generative AI models write better code. Projects typically include discrete, highly variable problems that involve engaging with these models as they learn to code. There is no requirement for previous AI experience.\nAbout the opportunity:\nOutlier is looking for talented coders to help train generative artificial intelligence models\nThis freelance opportunity is remote and hours are flexible, so you can work whenever is best for you\nYou may contribute your expertise by…\nCrafting and answering questions related to computer science in order to help train AI models\nEvaluating and ranking code generated by AI models\nExamples of desirable expertise:\nCurrently enrolled in or completed a bachelor's degree or higher in computer science at a selective institution\nProficiency working with one or more of the the following languages: Java, Python, JavaScript / TypeScript, C++\nAbility to articulate complex concepts fluently in English\nExcellent attention to detail, including grammar, punctuation, and style guidelines\nPayment:\nCurrently, pay rates for core project work by Tier 2 coding experts in the U.S. average USD $30 per hour.\nRates vary based on expertise, skills assessment, location, project need, and other factors. For example, higher rates may be offered to PhDs. For non-core work, such as during initial project onboarding or project overtime phases, lower rates may apply. Certain projects offer incentive payments. Please review the payment terms for each project.\nPLEASE NOTE: We collect, retain and use personal data for our professional business purposes, including notifying you of opportunities that may be of interest and sharing with our affiliates. We limit the personal data we collect to that which we believe is appropriate and necessary to manage applicants’ needs, provide our services, and comply with applicable laws. Any information we collect in connection with your application will be treated in accordance with the Outlier Privacy Policy and our internal policies and programs designed to protect personal data.\nThis is a 1099 contract opportunity on the Outlier.ai platform. Because this is a freelance opportunity, we do not offer internships, sponsorship, or employment. You must be authorized to work in your country of residence. If you are an international student, you may be able to sign up for Outlier if you are on a visa. You should contact your tax and/or immigration advisor with specific questions regarding your circumstances.", "application_link": "https://uk.indeed.com/applystart?jk=e516e03a1da44f39&from=vj&pos=bottom&mvj=0&jobsearchTk=1icl00bskkhfk891&spon=1&adid=438265474&xkcb=SoAC6_M35VIOpJQklZ0LbzkdCdPP&sjdu=9nrDNPdV1DghkDNnC2WJlW1nrk21-asFvjSk9jx-s_OahcyDL3enda_PCIUmueTYwufOHvJV3iYiuzmuZ281Vf-FxpcXzbWq705RcoCMf_YWUq_mW9LL-GVD1Eal9gRsTQN2T0gCd10uer_2aOfBRuIQPjTqE1aVKL4rThiCNWxxIhCERPs3DUJkFfOkF6Xhss0p_BuQKtVXjiBySUiQjgoURullx1sjmFABPOha0BVjnMmTWsokqqDlApOUcQXGYITBQiJB7HGyfTAuCqVx_xp1lUHNe_ELwQc2sYwec9278-jJO5veNWw_Jj1wRz7k1AcFXssHvbB5zIEuIJMRqjf7XoHQIPWbkxQD2wWvLy_mCvVTAsJmUiTixFj2kpMEe182vxya2JIyllsK6_btCx6WhxXIgszKi10MaevvoUPpjpbeIjTfR-apg2z3k6MqijjTuDLyh8rCC-vpMMH5DeDuNaDvNeUYdl_fCak-1cPH5KtFCpeX-oxDFDpnVwz8Xe-bYgPkUXgsJYeAGKLpfNnviAXjHEOtgcRSTAJycfELVdgYyNjWkAS0KzSEdaW0yonIOEPtx30wIseOMnA1yHoZZobdN2car78XIFmSoJ3qEPt8Z5UwNVQUq8r9FTxavYqJLvceYHCkfqqz_nr_FfMNLkuxbHwodw3anHpWpI1GF0qeym7CFrijrIYVWFs_EkA-GWvaTS4WZCSwPgeViA&vjfrom=tp-sponfirstjob&asub=mob&astse=8fa7782983d140e6&assa=5815"}